## ขั้นตอนการจัดยา OPD
1.รับบัตรคิว
- รับบัตรคิวจากห้องออกบัตรคิว
- นำมาจัดวางนำมาจัดวางเพื่อเตรียมที่จะนำไปจัดยาโดยวางคัดแยกเป็นหมวดหมู่ โดยมีลำดับคิวตามนี้ T C N
- T คือคนไข้ที่มีความจำเป็นต้องใช้ยาเร่งด่วน ยาฉีด คิวพระสงฆ์ เบิกยาด่วน 
- C เป็นไข้โรคเรื้อรัง ที่รักษาต่อเนื่องกับโรงพยาบาล 
- N คนไข้ทั่วไปที่มารับบริการตามอาการปกติ หรือไม่มีนัดหมายล่วงหน้า
2.เตรียมการจัดยา
- นำบัตรคิวและใบนำทางใส่ตะกร้าตามหมวดหมู่ ของผู้มารับบริการ
- ตรวจสอบความสะอาดของตะกร้าและใช้ตะกร้า 1 คนต่อ 1 ตะกร้า
- ตรวจชื่อคนใข้ที่สติ๊กเกอร์ยา และ ใบนำทาง เมื่อตรงกันแล้ว เพิ่งเริ่มขั้นตอนการจัดยา
- ดูตำแหน่งที่จัดเก็บยาจากสติ๊กเกอร์ยา เช่น A1 หรือ ง63 เพื่อความรวดเร็วในการหยิบยา
3.ขั้นตอนการเลือกบรรจุภัณฑ์
- เตรียมซองยาให้ถูกต้องตามคุณสมบัติของยาแต่ละชนิด
- ยาไวต่อแสง เลือกใช้ "ซองสีชา" หรือซองทึบแสง เพื่อป้องกันยาเสื่อมสภาพจากรังสียูวี
- ยาทั่วไป: เลือกใช้ "ซองใส" มาตรฐาน เพื่อให้คนไข้และเภสัชกรเห็นลักษณะยาได้ชัดเจน
4.ขั้นตอนการจัดยา
- อ่านฉลากอย่างละเอียด: ตรวจสอบชื่อสามัญทางยา, ชื่อการค้า, ความแรง และจำนวนเม็ด/ขวด
- หยิบยา: หยิบยาจากชั้นวางตามหลัก FEFO (First Expired, First Out) คือยาไหนหมดอายุก่อนให้นำมาจัดก่อน
- การบรรจุลงซอง: * นำยาใส่ซองที่เลือกไว้ (ซองใสหรือซองชา)
- หากเป็นยาแบ่งบรรจุจากกระปุกใหญ่ต้องนับด้วยถาดนับยาที่สะอาด และระวังการปนเปื้อน
- หากเป็นยาแผงฟอยล์ (Blister pack) ให้ตัดแผงตามจำนวนที่ระบุโดยไม่ให้ฟอยล์ฉีกขาด
5.พนักงานผู้จัดยาทำการทวนสอบ( Double Check)
- ยาตรงตามชื่อในฉลากไหม จำนวนครบไหม
- ซองยาถูกต้องตามความไวต่อแสง
6.ส่งตะกร้ายา
- นำตะกร้าที่จัดเสร็จเรียบร้อยแล้วไปวาง ณ จุดพักยา เพื่อส่งต่อให้ เภสัชกร ทำการตรวจสอบความถูกต้องขั้นสุดท้ายและจ่ายยาให้คนไข้ต่อไป

### ขั้นตอนการจัดยา IPD (Ward) ด้วยเครื่องอัตโนมัติ
1.รับคำสั่งและเตรียมอุปกรณ์
- รับใบนำทางและสติ๊กเกอร์ยาจากเภสัชกร นำไปจัดใส่ตะกร้าที่สะอาด พร้อมทั้งเลือกซองยาให้เหมาะสมกับขนาดและความไวต่อแสงของตัวยา
2.เข้าสู่ระบบจัดยา
- เปิดโปรแกรมเครื่องจัดยาอัตโนมัติ และเข้าไปที่เมนู Waiting order list
3.ตรวจสอบข้อมูลผู้ป่วย
- คลิกเลือกชื่อคนไข้ให้ตรงกับในใบนำทาง โดยต้องตรวจสอบและยืนยันความถูกต้องจากหมายเลข HN ของคนไข้เสมอ
4.สั่งเครื่องจัดยาอัตโนมัติ
- เมื่อตรวจสอบชื่อและหมายเลข HN ถูกต้องแล้ว ให้กดปุ่มสั่งจ่ายยา (Dispense) เพื่อให้เครื่องเริ่มทำการแพ็คยาออกมาตามจำนวนซองโดยอัตโนมัติ
5.ตรวจสอบความถูกต้องของยา
- นำยาที่เครื่องแพ็คเสร็จแล้วมาตรวจสอบจำนวนเม็ดยาและความถูกต้องอย่างละเอียด ก่อนนำไปบรรจุลงในซองยาของคนไข้
6.ตรวจสอบขั้นสุดท้ายและส่งมอบ
- ส่งยาที่บรรจุเสร็จแล้วให้เภสัชกรทำการตรวจสอบความถูกต้องอีกครั้ง ก่อนนำไปจ่ายให้กับคนไข้เป็นอันจบกระบวนการ
